---
title: LoadCase
classe: Autodesk.Revit.DB.Structure.LoadCase
namespace: Autodesk.Revit.DB.Structure
eredita: Autodesk.Revit.DB.Element
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 8
---

# LoadCase

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `ElementId NatureId { get; set; }` | `loadCase.NatureId` | ElementId |
| `Int32 Number { get; set; }` | `loadCase.Number` | Int32 |
| `ElementId SubcategoryId { get; set; }` | `loadCase.SubcategoryId` | ElementId |
| `LoadCase Create(Document, String, ElementId, ElementId)` | `LoadCase.Create(document, name, natureId, subcategoryId)` | LoadCase |
| `LoadCase Create(Document, String, ElementId, LoadCaseCategory)` | `LoadCase.Create(document, name, natureId, loadCaseCategory)` | LoadCase |
| `Boolean IsLoadCaseSubcategoryId(ElementId)` | `loadCase.IsLoadCaseSubcategoryId(loadCaseSubcategoryId)` | Boolean |
| `Boolean IsLoadNatureId(ElementId)` | `loadCase.IsLoadNatureId(natureId)` | Boolean |
| `Boolean IsNumberUnique(Document, Int32)` | `LoadCase.IsNumberUnique(document, number)` | Boolean |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```